# функция определения наличия в заданном элементе str символа из списка
def is_part_in_list(str_, words):
    for word in words:
        if word in str_:
            return True
    return False


print("Рассчет калорийности порции по типу и весу продукта.")
print("____________________________________________________\n")
l = {
'Молоко':60,
'Кефир':53,
'Творог':145,
'Яйцо куриное':157,
'Макароны':333,
'Йогурт':68,
'Мороженое пломбир':232,
'Сметана':206,
'Сыр твердый':344,
'Скумбрия':191,
'Щука':84,
'Кальмар':100,
'Икра красная':249,
'Батон':262,
'Крупа рисовая':333,
'Мука':329,
'Печенье':417,
'Хлеб':201,
'Сушки':339,
'Сухари':399,
'Фасоль':298,
'Арахис':552,
'Миндаль':609,
'Фундук':653,
'Кабачки':24,
'Капуста белокочанная':28,
'Капуста брокколи':34,
'Капуста пекинская':16,
'Картофель':77,
'Морковь':35,
'Огурец':14,
'Помидор':24,
'Редис':20,
'Свекла':42,
'Спаржа':21,
'Тыква':22,
'Чеснок':149,
'Шпинат':23,
'Абрикос':44,
'Авокадо':160,
'Ананас':52,
'Апельсин':43,
'Банан':96,
'Виноград':72,
'Гранат':72,
'Грейпфрут':35,
'Груша':47,
'Ежевика':34,
'Лимон':34,
'Киви':47,
'Мандарин':38,
'Персик':45,
'Яблоки':47,
'Курага':32,
'Чернослив':256,
'Финики':292,
'Грибы белые':34,
'Грибы шампиньоны':27,
'Сок апельсиновый':45,
'Сок виноградный':70,
'Сок морковный':56,
'Масло подсолнечное':899,
'Масло оливковое':898,
'Майонез':629,
'Колбаса сервелат':461,
'Колбаски охотничьи':463
}

# получаем список ключей JSON l
l_keys = []
for x in l:
    l_keys.append(x)
    
# получаем список ключей JSON l переведенных в lowercase
lowercase_l_keys = [x.lower() for x in l_keys]

# получаем список ключей JSON без учета регистра заглавных букв
l_keys_add_low = []
for x in l_keys:
    l_keys_add_low.append(x)
for x in lowercase_l_keys:
    l_keys_add_low.append(x)

# перевод JSON в lowercase в отдельный JSON
lowercase_l = {key.lower(): val for key, val in l.items()}

# сам скрипт рассчета
print("Выберите тип продукта питания, введите на выбор:", l_keys)
count = 0
while count == 0:
    food = input()
    while not l_keys_add_low.count(food):
        print("Введите корректно тип продукта питания из предложенного списка")
        food = input()
    print("Введите количество грамм продукта (в целых числах)")
    massa = input()
    while massa or massa == "":
        if massa == "":
            print("Вы ввели пустое значение")
        elif bool(massa.count("-")):
            print("Вы ввели число меньше 0")
        elif massa == "0":
            print("Вы ввели число равное 0")
        elif bool(massa.count(".")):
            print("Вы ввели не целое количество грамм")
        elif massa.isdigit():
            massa = int(massa)
            print("Вы ввёли", massa, "грамм по продукту", food.lower()+".")
            if is_part_in_list(food, list("ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМТЬБЮ")):
                print("По рассчету сумма калорий в данной порции =", massa / 100 * l.get(food), "ККал\n")
            else:
                print("По рассчету сумма калорий в данной порции =", massa / 100 * lowercase_l.get(food), "ККал\n")
            print("При желании можете рассчитать другую порцию из того же списка, введите тип продукта:")
            break
        else:
            print("Вы ввели не число")
        print("Введите количество грамм продукта (в целых числах)")
        massa = input()
